export const nextIndexes2_0 = [2, 6, 9, 11];
export const titles2_0 = [
  "수입, 비용, 자산에 대해 알아볼까요?",
  "계좌와 신용에 대해 알아볼까요?",
  "이자율과 적금, 예금에 대해 알아볼까요?",
  "금융 상품과 비금융 상품에 대해 알아볼까요?",
];
export interface DescriptionItem {
  [key: string]: string;
}
export const descriptionArr2_0: DescriptionItem[] = [
  {
    "먼저 수익에 대해 알아봅시다! 수익이란 무엇일까요?":
      "개인이나 기업이 일정 기간 동안 벌어들인 돈을 의미합니다.\n예를 들어, 개인의 월급, 기업의 매출 등이 수입에 해당합니다.",
  },
  {
    "이제 비용에 대해 알아볼까요? 비용이란?":
      "수입을 얻기 위해 지출한 금액을 말합니다.\n개인의 생활비, 기업의 원자재 비용 등이 비용에 포함됩니다.",
  },
  {
    "그렇다면 자산이란 무엇일까요?":
      "현재 소유하고 있는 모든 재산의 가치를 말합니다.\n이는 현금, 부동산, 주식 등 다양한 형태로 존재할 수 있습니다.",
  },
  {
    "그 다음 계좌에 대해서 알아봅시다. 계좌란 무엇일까요?":
      "은행이나 금융기관에 개설한 예금, 적금, 대출 등의 거래를 기록하는 장부입니다.",
  },
  {
    "계좌에는 예금계좌와 대출계좌가 있어요. 먼저 예금계좌란?":
      "고객이 돈을 맡기고 필요할 때 인출할 수 있는 계좌입니다.",
  },
  {
    "그렇다면 대출계좌란 무엇일까요?":
      "고객이 돈을 빌리고 일정 기간 동안 갚아야 하는 계좌입니다.",
  },
  {
    "추가로 신용에 대해서도 알아봅시다. 신용이란?":
      "개인이나 기업이 대출을 받을 때 그 상환 능력을 평가한 것입니다.\n신용도가 높으면 낮은 금리로 대출을 받을 수 있습니다.",
  },
  {
    "이제 이자율에 대해서 알아봐요. 이자율은 무엇일까요?":
      "예금이나 대출 시 적용되는 이자의 비율입니다.\n예금 이자율은 예금을 맡겼을 때 받는 이자의 비율이고, 대출 이자율은 돈을 빌렸을 때 갚아야 할 이자의 비율입니다.",
  },
  {
    "적금과 예금 또한 중요한 개념이랍니다. 먼저 적금이란 무엇일까요?":
      "일정 기간 동안 정기적으로 일정 금액을 저축하고 만기 시 이자와 함께 돌려받는 금융 상품입니다.",
  },
  {
    "그렇다면 예금이란 무엇일까요?":
      "한꺼번에 일정 금액을 예치하고 일정 기간 후 원금과 이자를 받는 금융 상품입니다.",
  },
  {
    "마지막으로 금융상품과 비금융상품에 대해서 알아봐요.\n먼저 금융상품부터 알아볼까요? 금융상품이란?":
      "은행, 증권사 등 금융기관에서 제공하는 투자 및 저축 상품입니다.\n예금, 적금, 주식, 채권, 펀드 등이 포함됩니다.",
  },
  {
    "마지막으로 비금융상품에 대해서도 알아봅시다.\n비금융상품이란 무엇일까요?":
      "금융기관에서 제공하지 않는 일반적인 상품 및 서비스입니다.\n예를 들어, 부동산, 골동품, 예술품 등이 이에 해당합니다.",
  },
];
