export interface DescriptionItem {
  [key: string]: string;
}
export const descriptionArr2_0: DescriptionItem[] = [
  {
    "먼저 수익에 대해 알아봅시다! 수익이란 무엇일까요?":
      "개인이나 기업이 일정 기간 동안 벌어들인 돈을 의미합니다.\n예를 들어, 개인의 월급, 기업의 매출 등이 수입에 해당합니다.",
  },
  {
    "이제 비용에 대해 알아볼까요? 비용이란?":
      "수입을 얻기 위해 지출한 금액을 말합니다.\n개인의 생활비, 기업의 원자재 비용 등이 비용에 포함됩니다.",
  },
  {
    "그렇다면 자산이란 무엇일까요?":
      "현재 소유하고 있는 모든 재산의 가치를 말합니다.\n이는 현금, 부동산, 주식 등 다양한 형태로 존재할 수 있습니다.",
  },
  {
    "그 다음 계좌에 대해서 알아봅시다. 계좌란 무엇일까요?":
      "은행이나 금융기관에 개설한 예금, 적금, 대출 등의 거래를 기록하는 장부입니다.",
  },
  {
    "계좌에는 예금계좌와 대출계좌가 있어요. 먼저 예금계좌란?":
      "고객이 돈을 맡기고 필요할 때 인출할 수 있는 계좌입니다.",
  },
  {
    "그렇다면 대출계좌란 무엇일까요?":
      "고객이 돈을 빌리고 일정 기간 동안 갚아야 하는 계좌입니다.",
  },
  {
    "추가로 신용에 대해서도 알아봅시다. 신용이란?":
      "개인이나 기업이 대출을 받을 때 그 상환 능력을 평가한 것입니다.\n신용도가 높으면 낮은 금리로 대출을 받을 수 있습니다.",
  },
  {
    "이제 이자율에 대해서 알아봐요. 이자율은 무엇일까요?":
      "예금이나 대출 시 적용되는 이자의 비율입니다.\n예금 이자율은 예금을 맡겼을 때 받는 이자의 비율이고, 대출 이자율은 돈을 빌렸을 때 갚아야 할 이자의 비율입니다.",
  },
  {
    "적금과 예금 또한 중요한 개념이랍니다. 먼저 적금이란 무엇일까요?":
      "일정 기간 동안 정기적으로 일정 금액을 저축하고 만기 시 이자와 함께 돌려받는 금융 상품입니다.",
  },
  {
    "그렇다면 예금이란 무엇일까요?":
      "한꺼번에 일정 금액을 예치하고 일정 기간 후 원금과 이자를 받는 금융 상품입니다.",
  },
  {
    "마지막으로 금융상품과 비금융상품에 대해서 알아봐요.\n먼저 금융상품부터 알아볼까요? 금융상품이란?":
      "은행, 증권사 등 금융기관에서 제공하는 투자 및 저축 상품입니다.\n예금, 적금, 주식, 채권, 펀드 등이 포함됩니다.",
  },
  {
    "마지막으로 비금융상품에 대해서도 알아봅시다.\n비금융상품이란 무엇일까요?":
      "금융기관에서 제공하지 않는 일반적인 상품 및 서비스입니다.\n예를 들어, 부동산, 골동품, 예술품 등이 이에 해당합니다.",
  },
];
export const images2_0 = ["dummyImage.jpeg"];
export const nextIndexes2_0 = [2, 6, 9, 11];
export const imageIndexes2_0 = Array.from(
  { length: descriptionArr2_0.length },
  () => -1,
);
export const titles2_0 = [
  "수입, 비용, 자산에 대해 알아볼까요?",
  "계좌와 신용에 대해 알아볼까요?",
  "이자율과 적금, 예금에 대해 알아볼까요?",
  "금융 상품과 비금융 상품에 대해 알아볼까요?",
];

export const descriptionArr2_1: DescriptionItem[] = [
  {
    "먼저 증시에 대해 알아봅시다. 증시란?":
      "증권 시장의 줄임말인 증시는 주식, 채권 등 증권이 거래되는 시장을 의미합니다.\n대표적으로 뉴욕증권거래소(NYSE), 나스닥(NASDAQ), 한국거래소(KRX) 등이 있습니다.",
  },
  {
    "그렇다면 증권이란?":
      "주식, 채권 등 투자 자산을 의미하며, 소유자가 일정한 권리를 가지게 되는 금융 상품입니다.",
  },
  {
    "자본금이란?":
      "회사가 사업을 위해 주주들로부터 투자받은 돈을 말합니다.\n이는 회사의 주식을 발행해 조달됩니다.",
  },
  {
    "수익을 얻는 방법에는 시세 차익과 배당금이 있어요.\n먼저 시세 차익에 대해 알아볼까요?":
      "시세차익이란 주식을 낮은 가격에 사서 높은 가격에 팔아 차익을 얻는 방법입니다.",
  },
  {
    "시세 차익 외 수익을 얻는 방법인 배당금에 대해 알아봐요. 배당금이란?":
      "회사가 이익을 주주들에게 분배하는 돈을 말합니다.\n주주는 배당금을 통해 정기적인 수익을 얻을 수 있습니다.",
  },
  {
    "ETF란?":
      "'상장지수펀드'라고도 하는 ETF는 주식처럼 거래소에 상장되어 거래되는 펀드입니다.\n'S&P 500'과 같은 특정 지수를 추종하며, 여러 주식이나 자산으로 구성되어 있어 분산 투자 효과를 제공합니다.",
  },
  {
    "채권이란?":
      "정부나 기업이 자금을 조달하기 위해 발행하는 일종의 차용 증서입니다.\n채권을 소유한 투자자는 정해진 이자(쿠폰)를 일정 기간 동안 받고, 만기 시 원금을 돌려받습니다.\n채권은 비교적 안정적인 투자 수단으로 간주됩니다.",
  },
];
export const images2_1 = ["dummyImage.jpeg"];
export const nextIndexes2_1 = [1, 2, 4, 5, 6];
export const imageIndexes2_1 = Array.from(
  { length: descriptionArr2_1.length },
  () => -1,
);
export const titles2_1 = [
  "증시와 증권에 대해 알아볼까요?",
  "이제 주식에 대해 알아봅시다. 먼저 자본금에 대해 알아볼까요?",
  "주식을 통해 수익을 얻는 방법에 대해 알아보아요.",
  "주식 외에도 ETF와 채권이라는 것이 있습니다. 먼저 ETF에 대해 알아볼까요?",
  "마지막으로 채권에 대해 알아봅시다.",
];

export const descriptionArr2_3: DescriptionItem[] = [
  {
    기업분석:
      "근거있는 투자의 필수, 기업분석은 뭘까요? \n 기업분석이란 기업의 경영 현황과 재무 상태를 종합적으로 살펴보는 것입니다.",
  },
  {
    왜: "기업 분석, 뭔가 귀찮은데... 왜 꼭 해야 하냐구요?\n기업 분석을 통해 투자할 기업을 판단하고, 기준에 따라 '이유 있는' 투자를 할 수 있기 때문이죠!",
  },
  {
    어디서:
      "이제 좀 이해가 되셨으려나...?\n좋아요! 그럼 이제 네이버 증권에 들어가서 기업 분석을 시작해볼까요?\n우선, 들어가서 종목 분석-> 기업 개요를 확인해봅시다!",
  },
  {
    무엇을:
      "좋아요! 기업이 뭘 하는지는 대충 알았고...\n으악! 뭐가 이렇게 복잡하냐구요? 우선 투자 첫걸음은 간단하게 기업실적분석부터 확인해봐요",
  },
  {
    기업실적분석:
      "기업실적분석을 보면 기업의 재무상태나 수익성 등을 파악할 수 있어요.\n 즉, 투자할만한 가치가 있는지 직접 두 눈으로 확인하는거죠! 놀랍지 않나요?",
  },
  {
    매출액:
      "매출액 부분부터 확인해볼까요?\n매출액은 특정 기간 동안 기업이 제품이나 서비스를 판매하여 얻은 총 수익을 의미합니다. 이는 기업의 성장성과 시장 점유율을 판단하는 중요한 지표입니다.",
  },
  {
    영업이익:
      "영업이익이란 뭘까요?\n영업이익은 매출액에서 영업 비용을 차감한 금액으로, 기업의 주된 영업활동으로부터 벌어들인 순이익을 나타냅니다. 이는 기업의 수익성 및 효율성을 평가하는 핵심 지표입니다.",
  },
  {
    순이익:
      "순이익은 또 뭐죠? 어렵지 않아요!\n순이익은 영업이익에서 이자 비용, 세금 등을 차감한 최종 이익을 의미합니다. 이는 주주에게 돌아가는 이익으로, 기업의 전체적인 재무 건전성을 평가하는 데 사용됩니다.",
  },
  {
    부채비율:
      "부채비율을 확인해봐요.\n부채비율은 기업의 총 부채를 자기자본으로 나눈 비율로, 기업의 재무 건전성과 부채 부담을 나타냅니다. 높은 부채비율은 재무 리스크가 크다는 신호일 수 있습니다.",
  },
  {
    PER: "엥? 웬 영어인가 싶죠?\nPER은 주가를 주당순이익(EPS)으로 나눈 비율로, 주가가 기업의 이익에 비해 고평가 또는 저평가되었는지를 판단하는 데 사용됩니다. 낮은 PER은 상대적으로 저평가된 주식을 의미할 수 있습니다.",
  },
  {
    그리고: "그 밖에도 여러가지 확인할 게 많아요!\n",
  },
  {
    축하해요:
      "축하드려요! 기업분석을 통해 기업을 판단할 수 있을 것 같아요.\n이제 무지성 침팬지 투자는 안하시겠죠?",
  },
];
export const images2_3 = [
  "UNIT2_3/기업분석.jpg",
  "UNIT2_3/기업실적분석왜.jpg",
  "UNIT2_3/네이버증권기업분석.png",
  "UNIT2_3/기업실적분석.png",

  "UNIT2_3/네이버기업실적분석.png",
  "UNIT2_3/삼전매출액.png",
  "UNIT2_3/삼전영업이익액.png",
  "UNIT2_3/삼전순이익.png",
  "UNIT2_3/삼전부채비율.png",

  "UNIT2_3/종목판단지표.png",
  "UNIT2_3/그외.png",
  "UNIT2_3/축하원숭이.png",
];
export const nextIndexes2_3 = Array.from(
  { length: descriptionArr2_3.length },
  (_, i) => i,
);
export const imageIndexes2_3 = Array.from(
  { length: descriptionArr2_3.length },
  (_, i) => i,
);
export const titles2_3 = Array.from(
  { length: descriptionArr2_3.length },
  () => "근거있는 투자, 기업분석이란 무엇일까요?",
);
